/*В последовательности из n целых чисел найти и вывести значение суммы четных элементов.*/
#include <iostream>
using namespace std;

int main() {
    setlocale(LC_CTYPE, "rus");
    int n; // количество элементов в последовательности

    cout << "Введите количество элементов последовательности: ";
    cin >> n;

    if (n <= 0) {
        cout << "Последовательность не может быть пустой." << endl;
        return 1;
    }

    int sum = 0; // переменная для хранения суммы четных элементов

    for (int i = 1; i <= n; ++i) {
        int number;
        cout << "Введите элемент под номером " << i << ": ";
        cin >> number;

        if (i % 2 == 0) {
            sum += number;
        }
    }

    cout << "Сумма четных элементов равна " << sum << endl;

    return 0;
}
