#include <iostream>

#include <Windows.h>

#include <locale>

#include <ctime> // Падключаем для выкарыстання функцыі time

using namespace std;


int main() {

	SetConsoleCP(1251);

	SetConsoleOutputCP(1251);


	const int n = 101;

	int k, a[n], s = 0;

	cout << "Введите размер массива(<101) =  ";

	cin >> k;

	if (k > n) {

		cout << "Ошибка";

		return 0;

	}


	srand((unsigned)time(NULL));

	for (int i = 0; i < k; i++) { // Формируем массив из случайных чисел

		a[i] = rand() % 80;

	}

	for (int i = 0; i < k; i++) { // Вывод получившегося массива

		cout << a[i] << " ";

	}

	cout << endl;


	int m = k; // Сохраняем размер массива, чтоб не было ошибки E0137(выражение должно быть допустимым для изменения)

	for (int i = 0; i < m; i++) {

		if (a[i] % 2 != 0) { // Проверяем на четность

			for (int j = i; j < m; j++) { // Цикл для сдвига элементов массива после удаления нечетного
				a[j] = a[j + 1];
			}


				m--; // Уменьшаем переменную m, чтобы показать удаление элемента массива

				i--; // Уменьшаем i, чтобы повторно проверить индекс после удаления элемента

				s += 1; // Увеличиваем s, следим за количеством удаленных
			
		}

		if (s == 5) { break; } // Удаляем 5 и останавливаемся

	}

	m += 3; // Увеличиваем массив

	for (int i = m - 3; i < m; i++) { // Добавляем 3 новых элемента

		a[i] = 0;

	}

	for (int i = 0; i < m; i++) {

		cout << a[i] << " ";

	}
}