#include <iostream>


int main() {
    setlocale(LC_ALL, "Rus");
    using namespace std;
    int k;
    puts("Здравствуйте, выберите вид транспорта для приобретения( 1 — машина, 2 — мотоцикл, 3 — велосипед, 4 — никакой)");
    cin >> k;
    switch (k)
    {
    case 1:
    {
        puts("Какая?( 1 — bmw, 2 — audi, 3 — mersedes");
        cin >> k;
        switch (k)
        {
        case 1: puts("Замечательный выбор для скоростных трасс!!!"); break;
        case 2: puts("Наилучший выбор для бездорожья!!!"); break;
        case 3: puts("Весьма странный выбор, но он имеет место быть!!!"); break;
        }
        break;
    }
    case 2:
    {
        puts("Какой мотоцикл предпочитаете? ( 1 — советский, 2 — спортивный, 3 — кроссовый)");
        cin >> k;
        switch (k)
        {
        case 1: puts("Самый удобный вариант для езды как по бездорожью, так и по трассе!!!"); break;
        case 2: puts("Неплохой выбор для трассы!!!"); break;
        case 3: puts("Хороший вариант для бездорожья!!!"); break;
        }
        break;
    }
    case 3:
    {
        puts("Какой велосипед вы хотите?( 1 — шоссейный, 2 — горный)");
        cin >> k;
        switch (k)
        {
        case 1: puts("Отличный выбор для ровных дорог!!!"); break;
        case 2: puts("Суперский выбор для езды по бездорожью!!!"); break;
        }
        break;
    }
    case 4: puts("Полезно ходить пешком!!!"); break;
    default: puts("Некорректный ввод"); break;
    }
    return 0;
}
