#include <iostream>

#include <Windows.h>

#include <ctime> // Падключаем для выкарыстання функцыі time


using namespace std;


int main() {


	SetConsoleCP(1251);

	SetConsoleOutputCP(1251);


	const int n = 333;

	int k, a[n];

	int count = 1; // Изначально устанавливаем счетчик в 1, так как каждый элемент считается подряд идущим сам с собой

	int maxCount = 1; // Переменная для хранения наибольшего числа подряд идущих элементов

	cout << "Увядзіце памер масіва (<333) ";

	cin >> k;

	if (k > n) {

		cout << "Памылка: перавышэнне максімальнага памеру масіва";

		return 0;

	}


	srand((unsigned)time(NULL));

	for (int i = 0; i < k; i++) { // Фарміруем масіў з выпадковых лікаў

		a[i] = rand() % 14; // Выбіраем невялікі дыяпазон, каб павялічыць шанец на тое, што мы пабачым лічбу большую за 2

	}

	for (int i = 0; i < k; i++) { // Вывад першапачатковага масіва, каб потым заўважыць розніцу

		cout << a[i] << " ";

	}

	cout << endl;



	for (int i = 0; i < k - 1; i++) { // Падлік колькасці суседніх элементаў з аднолькавымі значэннямі

		if (a[i] == a[i + 1]) {

			count++;

			if (count > maxCount) {

				maxCount = count;

			}

		}

		else {

			count = 1; // Калі бягучы элемент не супадае з мінулым, абнуляем лічыльнік

		}

	}


	cout << "Найбольшая колькасць аднолькавых элементаў, якія ідуць запар: " << maxCount << endl;


	return 0;

}